import Link from 'next/link';
import { Row, Col } from 'antd';
import { Button } from 'antd';
// import Image from 'next/image';

const Details = ({ props }) => {
  return (
    <div id="Details">
      <Row>
        <Col>
          <h1>เว็บไซต์หน่วยงานสำเร็จรูป ใช้งานง่าย ไม่ยุ่งยาก</h1>
          <h3>
            GOVERNMENT icti เราเป็นเว็บไซต์หน่วยงานสำเร็จรูปสำหรับหน่วยงานราชการ
            เว็บไซต์ อปท เช่น เทศบาล องค์การบริหารส่วนตำบล
            โรงพยาบาลส่งเสริมสุขภาพตำบล เป็นต้น
          </h3>
          <h3>
            สามารถสร้างไซต์หน่วยงานท่านได้ตัวเอง ง่าย เร็ว สวยงาม ไม่ยุ่งยาก
            ครบตามมาตราฐานเว็บไซต์หน่วยงานภาครัฐ
            เป็นระบบที่ถูกออกแบบขึ้นมาเพื่อเป็นเว็บไซต์หน่วยงานราชการต่างๆโดยเฉพาะ{' '}
          </h3>
          <h3>
            ไม่ใช่เว็บไซต์ที่สร้างขึ้นมาด้วย WordPress หรือ แพลตฟอร์มอื่นๆ
            และมีการจัดเก็บข้อมูลบน Cloud ที่เป็นมาตราฐาน
          </h3>
        </Col>
      </Row>
      <Row>
        <Col>
          {/* <Image src="#" alt="me" width="64" height="64" /> */}
          <a>Responsive Website</a>
          <a>รองรับหน้าจออุปกรณ์ทุกชนิด แสดงผลได้อย่าง "สมบูรณ์แบบ"</a>
        </Col>
        <Col>
          {/* <Image src="#" alt="me" width="64" height="64" /> */}
          <a>แก้ไขข้อมูลง่าย</a>
          <a>แก้ไขข้อมูลด้วยตัวเอง ไม่ต้องเขียนโปรแกรม</a>
        </Col>
        <Col>
          {/* <Image src="#" alt="me" width="64" height="64" /> */}
          <a>เว็บไซต์สวย ทันสมัย</a>
          <a>TEMPLATE ที่ออกแบบมาอย่างลงตัว มีความเป็นมืออาชีพ</a>
        </Col>
        <Col>
          {/* <Image src="#" alt="me" width="64" height="64" /> */}
          <a>รองรับการทำ SEO</a>
          <a>ให้เว็บไซต์ติดอันดับการค้นหา</a>
        </Col>
        <Col>
          {/* <Image src="#" alt="me" width="64" height="64" /> */}
          <a>มีทีมงาน support</a>
          <a>มีทีมงานให้ความช่วยเหลือ ตลอดการใช้งาน</a>
        </Col>
      </Row>
      <Button>ทดลองใช้งาน</Button>
    </div>
  );
};

export default Details;
