import Link from 'next/link';
import { Button } from 'antd';
import { Card } from 'antd';

const Package = ({ props }) => {
  return (
    <div id="Package">
      <Card style={{ width: 300 }}>
        <h2>Connect</h2>
        <h4>Cloud server 50 Mb</h4>
        <hr />
        <li>เพิ่ม ลบ แก้ไข เนื้อหาเว็บไซต์ได้ด้วยตัวเอง</li>
        <li>เปลี่ยนภาพ Slide กิจกรรมของหน่วยงาน</li>
        <li>แสดงหน้าวันสำคัญอัตโนมัติ ตั้งเวลาแสดงผลเนื้อหาได้</li>
        <li>Support SEO</li>
        <li>ระบบประกวดราคา ข่าวประขาสัมพันธ์</li>
        <li>กระดานข่าว คลังเอกสารราชการ</li>
        <li>ระบบสถิติผู้เข้าชมเว็บ</li>
        <li>Theme เว็บไซต์มาตราฐาน</li>
        <li>แสดง โฆษณา</li>
        <li>Theme เว็บไซต์มาตราฐาน</li>
        <hr />
        <h2>1,800 บาท</h2>
        <h4>ต่อปี *ราคารวมภาษีมูลค่าเพิ่มแล้ว</h4>
        <Button>ขอใบเสนอราคา</Button>
      </Card>
      <Card style={{ width: 300 }}>
        <h2>Standard</h2>
        <h4>Cloud server 4GB</h4>
        <hr />
        <li>เพิ่ม ลบ แก้ไข เนื้อหาเว็บไซต์ได้ด้วยตัวเอง</li>
        <li>เปลี่ยนภาพ Slide กิจกรรมของหน่วยงาน</li>
        <li>แสดงหน้าวันสำคัญอัตโนมัติ ตั้งเวลาแสดงผลเนื้อหาได้</li>
        <li>Support SEO</li>
        <li>ระบบประกวดราคา ข่าวประขาสัมพันธ์</li>
        <li>ระบบร้องทุกข์ และสำรวจความคิดเห็น</li>
        <li>ระบบสถิติผู้เข้าชมเว็บ</li>
        <li>Theme เว็บไซต์มาตราฐาน</li>
        <li>ไม่แสดง โฆษณา</li>
        <li>Theme เว็บไซต์มาตราฐาน</li>
        <hr />
        <h2>5,300 บาท</h2>
        <h4>ต่อปี *ราคารวมภาษีมูลค่าเพิ่มแล้ว</h4>
        <Button>ขอใบเสนอราคา</Button>
      </Card>
      <Card style={{ width: 300 }}>
        <h2>Premium</h2>
        <h4>Cloud server ไม่จำกัด</h4>
        <hr />
        <li>จดทะเบียน .com หรือ .go.th</li>
        <li>Email @ชื่อเว็บไซค์หน่วยงาน ( 1 Email)</li>
        <li>เพิ่ม ลบ แก้ไข เนื้อหาเว็บไซต์ได้ด้วยตัวเอง</li>
        <li>เปลี่ยนภาพ Slide กิจกรรมของหน่วยงาน</li>
        <li>แสดงหน้าวันสำคัญอัตโนมัติ ตั้งเวลาแสดงผลเนื้อหาได้</li>
        <li>Support SEO</li>
        <li>ระบบประกวดราคา ข่าวประขาสัมพันธ์</li>
        <li>กระดานข่าว คลังเอกสารราชการ</li>
        <li>ระบบร้องทุกข์ และสำรวจความคิดเห็น</li>
        <li>ระบบสถิติผู้เข้าชมเว็บ</li>
        <li>Theme เว็บไซต์มาตราฐาน</li>
        <li>ย้ายข้อมูลพื้นฐานจากเว็บไซต์เดิมมายังเว็บไซต์ใหม่ ในครั้งแรก</li>
        <li>ไม่แสดงโฆษณา</li>
        <h2>1,800 บาท</h2>
        <h4>ต่อปี *ราคารวมภาษีมูลค่าเพิ่มแล้ว</h4>
        <Button>ขอใบเสนอราคา</Button>
      </Card>
    </div>
  );
};

export default Package;
